# More pandas practice!

<img src="Panda-Rolling-3-Alt.gif"> 

[gif source](https://disneyrewards.com/app/uploads/sites/9/Panda-Rolling-3-Alt.gif)

This week we will take a look at some more pandas functions and use practice using documentation to help us understand using them. 
We'll look at...
- `.apply()`, `Series.map()`, and `DataFrame.map()`
- `.groupby()`, `.agg()` and `.pivottable()`
- `.join()`, `.merge()`, and `.concat()`

And as a (non-pandas) bonus... `lambda` functions!


**Remember - practice is the best way to get more comfortable coding! You'll likely never know \*all\* the functions in pandas... but the ones you use frequently will stick and you should get comfortable using documentation to use the others!**

[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/ali-rivera/Python-Support-Hours/blob/main/7_Pandas3/Pandas_3.ipynb)

### Load in Data
This data comes from [Kaggle](https://www.kaggle.com/datasets/giodev11/usstates-dataset)

In [1]:
import pandas as pd
import numpy as np

In [2]:
# which version of pandas are you using - useful for understanding version update issues
print(pd.__version__)

2.0.3

In [3]:
# load in data files

abbrev = pd.read_csv("state-abbrevs.csv")
areas = pd.read_csv("state-areas.csv")
pops = pd.read_csv("state-population.csv")

In [4]:
# show first 5 lines of each df

display(abbrev.head(), areas.head(), pops.head())

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

## Labmda functions

[Lambda functions](https://www.w3schools.com/python/python_lambda.asp) are small functions that you can quickly build and call in python. They are useful if you have one or more inputs to a function, and only need to perform one expression/action.

In [5]:
# a function tha takes a value (x) and multiplies it by 2

multiply2 = lambda x : x * 2
multiply2(5)

10

## .join(), .merge(), and .concat()

[.join()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) is a function that joins columns of one DataFrame with another using the index to join - meaning the DataFrames you are joining must have the same index!

In [6]:
# Use .join() to combine abbrev and areas
abbrev.set_index('state').join(areas.set_index('state')).head()

           abbreviation  area (sq. mi)
state
Alabama              AL          52423
Alaska               AK         656425
Arizona              AZ         114006
Arkansas             AR          53182
California           CA         163707

[.merge()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) is another function that merges DataFrames together, either on column names or indexes. The function looks for columns with the same name, but you can also specify what column you want to merge on.

In [7]:
# use .merge() to combine abbrev and areas
merge_area = abbrev.merge(areas)

In [8]:
# create version of pops (where year=2013 and age=total) to merge with
merge_pops = pops[(pops['year']==2013) & (pops['ages']=='total')].drop(columns=['ages', 'year'])

In [9]:
# look at pops and area to merge
display(merge_pops.head(), merge_area.head())

    state/region  population
9             AL   4833722.0
87            AK    735132.0
103           AZ   6626624.0
185           AR   2959373.0
199           CA  38332521.0

        state abbreviation  area (sq. mi)
0     Alabama           AL          52423
1      Alaska           AK         656425
2     Arizona           AZ         114006
3    Arkansas           AR          53182
4  California           CA         163707

In [10]:
# use merge to combine merge_pops (where year=2013 and age=total) and merge_area
# note that these have different column names for the state abbreviation - we can specify that with the function parameters!
merged_df = merge_pops.merge(merge_area, left_on='state/region', right_on='abbreviation').drop('abbreviation', axis=1)
merged_df

   state/region  population                 state  area (sq. mi)
0            AL   4833722.0               Alabama          52423
1            AK    735132.0                Alaska         656425
2            AZ   6626624.0               Arizona         114006
3            AR   2959373.0              Arkansas          53182
4            CA  38332521.0            California         163707
5            CO   5268367.0              Colorado         104100
6            CT   3596080.0           Connecticut           5544
7            DE    925749.0              Delaware           1954
8            DC    646449.0  District of Columbia             68
9            FL  19552860.0               Florida          65758
10           GA   9992167.0               Georgia          59441
11           HI   1404054.0                Hawaii          10932
12           ID   1612136.0                 Idaho          83574
13           IL  12882135.0              Illinois          57918
14           IN   6570902.0               Indiana          36420
15           IA   3090416.0                  Iowa          56276
16           KS   2893957.0                Kansas          82282
17           KY   4395295.0              Kentucky          40411
18           LA   4625470.0             Louisiana          51843
19           ME   1328302.0                 Maine          35387
20           MD   5928814.0              Maryland          12407
21           MA   6692824.0         Massachusetts          10555
22           MI   9895622.0              Michigan          96810
23           MN   5420380.0             Minnesota          86943
24           MS   2991207.0           Mississippi          48434
25           MO   6044171.0              Missouri          69709
26           MT   1015165.0               Montana         147046
27           NE   1868516.0              Nebraska          77358
28           NV   2790136.0                Nevada         110567
29           NH   1323459.0         New Hampshire           9351
30           NJ   8899339.0            New Jersey           8722
31           NM   2085287.0            New Mexico         121593
32           NY  19651127.0              New York          54475
33           NC   9848060.0        North Carolina          53821
34           ND    723393.0          North Dakota          70704
35           OH  11570808.0                  Ohio          44828
36           OK   3850568.0              Oklahoma          69903
37           OR   3930065.0                Oregon          98386
38           PA  12773801.0          Pennsylvania          46058
39           RI   1051511.0          Rhode Island           1545
40           SC   4774839.0        South Carolina          32007
41           SD    844877.0          South Dakota          77121
42           TN   6495978.0             Tennessee          42146
43           TX  26448193.0                 Texas         268601
44           UT   2900872.0                  Utah          84904
45           VT    626630.0               Vermont           9615
46           VA   8260405.0              Virginia          42769
47           WA   6971406.0            Washington          71303
48           WV   1854304.0         West Virginia          24231
49           WI   5742713.0             Wisconsin          65503
50           WY    582658.0               Wyoming          97818

[.concat()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) is a function that concatenates pandas objects either by row (`axis=0`) or by column (`axis=1`).

In [19]:
# Add a new state to abbrev using .concat()
new_state = pd.DataFrame({'state':"New State", 'abbreviation': "NS"}, index=[0])
pd.concat([abbrev, new_state], ignore_index=True).tail()

            state abbreviation
47     Washington           WA
48  West Virginia           WV
49      Wisconsin           WI
50        Wyoming           WY
51      New State           NS

## .apply(), Series.map(), and DataFrame.map()

[.apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html) is a function that applies a function (that you pass in, as an argument) to a `DataFrame` either over a column of row.

In [13]:
# Use .apply() on merged_df to divide population and area by 1000
merged_df.set_index('state/region', inplace=True)
merged_df.loc[:,['population', 'area (sq. mi)']].apply(lambda x : x/1000).head()

              population  area (sq. mi)
state/region
AL              4833.722         52.423
AK               735.132        656.425
AZ              6626.624        114.006
AR              2959.373         53.182
CA             38332.521        163.707

[Series.map()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html) is a function that can be used to apply a function to a `Series` or map values to another defined value.

In [14]:
# use .map() on the series state from abbrev to make the state name lowercase
abbrev.state.map(str.lower).head()

0       alabama
1        alaska
2       arizona
3      arkansas
4    california
Name: state, dtype: object

[DataFrame.map()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.map.html) was previously called `.applymap()` and applies a function element-by-element to an entire DataFrame.

In [15]:
# use .map (or .applymap(), if you haven't updated your pandas) to make the entire abbrev df lowercase
abbrev.applymap(str.lower).head()

        state abbreviation
0     alabama           al
1      alaska           ak
2     arizona           az
3    arkansas           ar
4  california           ca

## .groupby(), .agg() and .pivot_table()

[.group_by()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) is a function that can be used to create a summary table from some subset of a `DataFrame`. In order to use `.groupby()`, you'll need to indicate some way to combine the data into the summary you want. You can use functions like .sum() or .mean().

In [16]:
# for the year 1996, .groupby() population by ages and state/region and get the sum 
pops[pops['year']==1996].groupby(['ages', 'state/region']).sum()

                      year  population
ages    state/region
total   AK            1996    608569.0
        AL            1996   4331103.0
        AR            1996   2572109.0
        AZ            1996   4586940.0
        CA            1996  32018834.0
...                    ...         ...
under18 VT            1996    151490.0
        WA            1996   1449613.0
        WI            1996   1352877.0
        WV            1996    422831.0
        WY            1996    135698.0

[106 rows x 2 columns]

[.agg()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html) is a function that aggregates information over an axis (either by rows `axis=0` or by columns `axis=1`). You'll need to specify how things should be aggregated by passing a function(s) like 'sum', 'min', 'max'... etc.

In [17]:
# use .groupby(['ages', 'state/region']) and then .agg() to get the mean - then drop the year column (bc a mean year is not entriely useful here)
pops.groupby(['ages', 'state/region']).agg('mean').drop('year', axis=1)

                        population
ages    state/region
total   AK            6.462048e+05
        AL            4.484528e+06
        AR            2.693178e+06
        AZ            5.294600e+06
        CA            3.433414e+07
...                            ...
under18 VT            1.409114e+05
        WA            1.492880e+06
        WI            1.344394e+06
        WV            4.049168e+05
        WY            1.322450e+05

[106 rows x 1 columns]

[.pivot_table()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) is a function that allows you to create a pivot table like in Microsoft Excel.

In [18]:
# use .pivot_table() to create the same outpu as above - the mean population over all years indexed by age and state/region
pd.pivot_table(pops, values='population', index=['ages', 'state/region'], aggfunc="mean")

                        population
ages    state/region
total   AK            6.462048e+05
        AL            4.484528e+06
        AR            2.693178e+06
        AZ            5.294600e+06
        CA            3.433414e+07
...                            ...
under18 VT            1.409114e+05
        WA            1.492880e+06
        WI            1.344394e+06
        WV            4.049168e+05
        WY            1.322450e+05

[106 rows x 1 columns]

## Next Steps

- Open up a new .ipynb (or .py, whatever you prefer) file.

- Try some practice problems from this site with [101 Pandas Practice problems](https://www.machinelearningplus.com/python/101-pandas-exercises-python/). If there are specific skills or functions you've been struggling with, `ctrl+F` key terms associated with that thing to find problems like it.

**Notes:**<br />
&emsp; - Each problem has a 'difficulty level' this is subjective, take it with a grain of salt. <br />
&emsp; - Some of the problems give you code you'll need to get started with along with the prompt. <br />
&emsp; - All problems have a `show solution` button. Try to struggle through problems before you show the solution - that's where the learning happens!<br />
&emsp; - There are usually multiple ways to do things. If you achieve the same result with a different method than the solution, give yourself a high five!